RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.h
#define CY_CAPSENSE_MAX_PRO_EPI_PRS_CYCLE_NUMBER                (1023u)

#define CY_CAPSENSE_CALIBRATION_REF_CDAC_MASK                   (0x01u)
#define CY_CAPSENSE_CALIBRATION_COMP_DIV_MASK                   (0x02u)
#define CY_CAPSENSE_CALIBRATION_COMP_CDAC_MASK                  (0x04u)

#define CY_CAPSENSE_MFS_FREQ_CHANNELS_NUM_MASK                  (0xFu)
#define CY_CAPSENSE_MFS_EN_MASK                                 (0x10u)
#define CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK                 (0x60u)
#define CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK                   (0x20u)
#define CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK                   (0x40u)

#define CY_CAPSENSE_SLOT_COUNT_MAX_VALUE                        (0xFFFFu)

/*******************************************************************************
* HSIOM and PC Macros redefinition platform dependent and for readability
*******************************************************************************/
#define CY_CAPSENSE_HSIOM_SEL_GPIO                          (HSIOM_SEL_GPIO)
#define CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD                    (HSIOM_SEL_CSD_SHIELD)
#define CY_CAPSENSE_HSIOM_SEL_CSD_SENSE                     (HSIOM_SEL_CSD_SENSE)
#define CY_CAPSENSE_HSIOM_SEL_AMUXA                         (HSIOM_SEL_AMUXA)
#define CY_CAPSENSE_HSIOM_SEL_AMUXB                         (HSIOM_SEL_AMUXB)
#define CY_CAPSENSE_DM_GPIO_ANALOG                          (CY_GPIO_DM_ANALOG)
#define CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF                   (CY_GPIO_DM_STRONG_IN_OFF)


#if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_USE_CAPTURE)

/*******************************************************************************
* Constant definition
*******************************************************************************/
/*
 *  Definition of the default configuration of the MSC HW registers that is
 *  intended to be used on the MSC HW block capturing stage.
 *  The configuration includes:
 *  1. Start of the analog settling process:
 *      - Enables the MSC HW block;
 *      - Enables all the sub-blocks of the MSC HW block;
 *      - Enables the Sense Modulator output;
 *  2. Clear all of the pending interrupt requests of the MSC HW block;
 *  3. Sets into default state the rest of the CSD HW block registers which are not related
 *     to actions #1 and #2.
*/

    #define CY_CAPSENSE_MSC_CONFIG_DEFAULT                  \
    {                                                       \
        .ctl                = MSC_CTL_SENSE_EN_Msk |        \
                              MSC_CTL_MSCCMP_EN_Msk |       \
                              MSC_CTL_ENABLED_Msk,          \
        .spare              = 0x00uL,                       \
        .scanCtl1           = 0x00uL,                       \
        .scanCtl2           = 0x00uL,                       \
        .initCtl1           = 0x00uL,                       \
        .initCtl2           = 0x00uL,                       \
        .initCtl3           = 0x00uL,                       \
        .initCtl4           = 0x00uL,                       \
        .senseDutyCtl       = 0x00uL,                       \
        .sensePeriodCtl     = 0x00uL,                       \
        .filterCtl          = 0x00uL,                       \
        .ccompCdacCtl       = 0x00uL,                       \
        .ditherCdacCtl      = 0x00uL,                       \
        .cswCtl             = 0x00uL,                       \
        .swSelGpio          = 0x00uL,                       \
        .swSelCdacRe        = 0x00uL,                       \
        .swSelCdacCo        = 0x00uL,                       \
        .swSelCdacCf        = 0x00uL,                       \
        .swSelCmod1         = 0x00uL,                       \
        .swSelCmod2         = 0x00uL,                       \
        .swSelCmod3         = 0x00uL,                       \
        .swSelCmod4         = 0x00uL,                       \
        .obsCtl             = 0x00uL,                       \
        .status1            = 0x00uL,                       \
        .status2            = 0x00uL,                       \
        .status3            = 0x00uL,                       \
        .resultFifoStatus   = 0x00uL,                       \
        .resultFifoRd       = 0x00uL,                       \
        .intr               = 0x00uL,                       \
        .intrSet            = 0x00uL,                       \
        .intrMask           = 0x00uL,                       \
        .intrMasked         = 0x00uL,                       \
        .frameCmd           = 0x00uL,                       \
        .sensorConfig =                                     \
        {                                                   \
            .snsSwSelCswMask2   = 0x00uL,                   \
            .snsSwSelCswMask1   = 0x00uL,                   \
            .snsSwSelCswMask0   = 0x00uL,                   \
            .snsScanCtl         = 0x00uL,                   \
            .snsCdacCtl         = 0x00uL,                   \
            .snsCtl             = 0x00uL,                   \
        },                                                  \
        .swSelCsw[0u]       = 0x00uL,                       \
        .swSelCsw[1u]       = 0x00uL,                       \
        .swSelCsw[2u]       = 0x00uL,                       \
        .swSelCsw[3u]       = 0x00uL,                       \
        .swSelCsw[4u]       = 0x00uL,                       \
        .swSelCsw[5u]       = 0x00uL,                       \
        .swSelCsw[6u]       = 0x00uL,                       \
        .swSelCsw[7u]       = 0x00uL,                       \
        .swSelCsw[8u]       = 0x00uL,                       \
        .swSelCsw[9u]       = 0x00uL,                       \
        .swSelCsw[10u]      = 0x00uL,                       \
        .swSelCsw[11u]      = 0x00uL,                       \
        .swSelCsw[12u]      = 0x00uL,                       \
        .swSelCsw[13u]      = 0x00uL,                       \
        .swSelCsw[14u]      = 0x00uL,                       \
        .swSelCsw[15u]      = 0x00uL,                       \
        .swSelCsw[16u]      = 0x00uL,                       \
        .swSelCsw[17u]      = 0x00uL,                       \
        .swSelCsw[18u]      = 0x00uL,                       \
        .swSelCsw[19u]      = 0x00uL,                       \
        .swSelCsw[20u]      = 0x00uL,                       \
        .swSelCsw[21u]      = 0x00uL,                       \
        .swSelCsw[22u]      = 0x00uL,                       \
        .swSelCsw[23u]      = 0x00uL,                       \
        .swSelCsw[24u]      = 0x00uL,                       \
        .swSelCsw[25u]      = 0x00uL,                       \
        .swSelCsw[26u]      = 0x00uL,                       \
        .swSelCsw[27u]      = 0x00uL,                       \
        .swSelCsw[28u]      = 0x00uL,                       \
        .swSelCsw[29u]      = 0x00uL,                       \
        .swSelCsw[30u]      = 0x00uL,                       \
        .swSelCsw[31u]      = 0x00uL,                       \
        .swSelCswFunc[0u]   = 0x00uL,                       \
        .swSelCswFunc[1u]   = 0x00uL,                       \
        .swSelCswFunc[2u]   = 0x00uL,                       \
        .swSelCswFunc[3u]   = 0x00uL,                       \
        .swSelCswFunc[4u]   = 0x00uL,                       \
        .swSelCswFunc[5u]   = 0x00uL,                       \
        .swSelCswFunc[6u]   = 0x00uL,                       \
        .swSelCswFunc[7u]   = 0x00uL,                       \
        .mode[0u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
        },                                                  \
        .mode[1u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
        },                                                  \
        .mode[2u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
        },                                                  \
        .mode[3u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
        },                                                  \
    }

    extern const cy_stc_msc_base_config_t cy_capsense_mscCfg;
#endif

#define CY_CAPSENSE_CSD_CDAC_COMP_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_EN))
#define CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE    ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_EN))
#define CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE         ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_EN))

#define CY_CAPSENSE_CSX_CDAC_COMP_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_EN))
#define CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE    ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_EN))
#define CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE         ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) &&\
                                                         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_EN))


#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_M0S8MSCV3 */

#endif /* CY_CAPSENSE_SENSING_V3_H */


/* [] END OF FILE */
